In [1]:
import numpy as np
from numpy import nan
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

## indexの階層構造

In [2]:
ser = Series(randn(6),index=[[1,1,1,2,2,2],['a','b','c','d','e','f']])

In [3]:
ser

1  a   -0.655981
   b    0.273151
   c    0.092314
2  d    0.528660
   e   -1.251962
   f   -1.561861
dtype: float64

In [4]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'd'),
            (2, 'e'),
            (2, 'f')],
           )

In [5]:
ser[1]

a   -0.655981
b    0.273151
c    0.092314
dtype: float64

In [6]:
ser[2]

d    0.528660
e   -1.251962
f   -1.561861
dtype: float64

In [7]:
ser[:,'d']

2    0.52866
dtype: float64

In [8]:
dframe = ser.unstack()

In [9]:
dframe

          a         b         c        d         e         f
1 -0.655981  0.273151  0.092314      NaN       NaN       NaN
2       NaN       NaN       NaN  0.52866 -1.251962 -1.561861

In [10]:
dframe.unstack()

a  1   -0.655981
   2         NaN
b  1    0.273151
   2         NaN
c  1    0.092314
   2         NaN
d  1         NaN
   2    0.528660
e  1         NaN
   2   -1.251962
f  1         NaN
   2   -1.561861
dtype: float64

In [11]:
dframe.T.unstack()

1  a   -0.655981
   b    0.273151
   c    0.092314
   d         NaN
   e         NaN
   f         NaN
2  a         NaN
   b         NaN
   c         NaN
   d    0.528660
   e   -1.251962
   f   -1.561861
dtype: float64

In [12]:
dframe2 = DataFrame(np.arange(16).reshape((4,4)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['NY','LA','SF','NY'],['cold','cold','hot','hot']])

In [13]:
dframe2

      NY   LA  SF  NY
    cold cold hot hot
a 1    0    1   2   3
  2    4    5   6   7
b 1    8    9  10  11
  2   12   13  14  15

In [14]:
dframe2.index.names=['index1','index2']

In [15]:
dframe2

                NY   LA  SF  NY
              cold cold hot hot
index1 index2
a      1         0    1   2   3
       2         4    5   6   7
b      1         8    9  10  11
       2        12   13  14  15

In [17]:
dframe2.columns.names=['city','temp']

In [18]:
dframe2

city            NY   LA  SF  NY
temp          cold cold hot hot
index1 index2
a      1         0    1   2   3
       2         4    5   6   7
b      1         8    9  10  11
       2        12   13  14  15

In [19]:
dframe2.swaplevel('city','temp',axis=1)

temp          cold     hot
city            NY  LA  SF  NY
index1 index2
a      1         0   1   2   3
       2         4   5   6   7
b      1         8   9  10  11
       2        12  13  14  15

In [24]:
dframe2.sort_index(1)

city            LA   NY      SF
temp          cold cold hot hot
index1 index2
a      1         1    0   3   2
       2         5    4   7   6
b      1         9    8  11  10
       2        13   12  15  14

In [25]:
dframe2.sum(level='temp',axis=1)
#　カラム毎にデータを扱うことが可能

temp           cold  hot
index1 index2
a      1          1    5
       2          9   13
b      1         17   21
       2         25   29